# Introduction

In this project, we will be looking at movie datasets in order to give recommendations to Microsoft's new movie studio.

Entertainment is a huge, global market. According to [Forbes](https://www.forbes.com/sites/rosaescandon/2020/03/12/the-film-industry-made-a-record-breaking-100-billion-last-year/?sh=5404bc6634cd), the film industry made over 100 billion dollars in 2019. While that is a significant chunck of change, there is also a significate overhead in creating entertainment content. It is important for fledgling movie studios to research what type of content does well, so that they can use this information as a guide to replicate that success. As Microsoft is interested in making movies, the following project with focus on that component of the entertainment industry.

## Data Sources

In order to glean information relevant to movie-making we will be looking at two datasets from https://www.imdb.com/ and https://www.boxofficemojo.com/. 

- IMDB stands for Internet Movie Database and is one of the most popular and comprehensive internet sources for movie and entertainment data. The dataset we are working with focuses on information about movies - the producers, the genres, the actors, the movies ratings, ect. 

- Box Office Mojo is a site that tracks box-office revenue, and the data set we will be using from them contains this information. 

By using these two datasets together, we can extract if certain aspects of a movie lead to higher box-office revenue, which is a industry standard for movie success. 

**Limitations** 

This data is only on movies, thus it can not be extrapolated to the entire entertainment industry. Additionally, as the dataset only contains the total gross, it will not include the costs of creating the movies. Finally, the dataset only looks at box office revenue, which means that the total revenue (from streaming sites or other source) may be higher.

## Objectives
 - Import datasets and do an initial viewing. 
 - Ask some relevant questions! 
 - Find answers to those questions, and do some analysis.
 - Conclusion.

# Method

First we are going to import some required packages needed to process the data. Then we will connect to our datasets and take a peek inside.

In [1]:
!pip install autopep8

Requirement already satisfied: autopep8 in c:\users\15164\anaconda3\envs\learn-env\lib\site-packages (1.6.0)
Requirement already satisfied: toml in c:\users\15164\anaconda3\envs\learn-env\lib\site-packages (from autopep8) (0.10.2)
Requirement already satisfied: pycodestyle>=2.8.0 in c:\users\15164\anaconda3\envs\learn-env\lib\site-packages (from autopep8) (2.8.0)

In [2]:
# importing required packages
import warnings
import zipfile
import seaborn as sns
import sqlite3 as sql
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
warnings.filterwarnings("ignore")

In [3]:
# unzip data
with zipfile.ZipFile('zipped_data/im.db.zip', 'r') as zip_ref:
    zip_ref.extractall('data')

## IMDB Dataset

In [4]:
# create connection to the database and cursor object:
conn = sql.connect('data/im.db')
cur = conn.cursor()

# find table names
cur.execute(""" SELECT name 
                FROM sqlite_master 
                WHERE type = 'table';""")

# fetch the result and store it in table_names
table_names = cur.fetchall()
table_names

[('movie_basics',),
 ('directors',),
 ('known_for',),
 ('movie_akas',),
 ('movie_ratings',),
 ('persons',),
 ('principals',),
 ('writers',)]

Above we see 8 tables names - lets look into those tables now. 

For the `movie_basics` table:

In [5]:
# creating movie_basics dataframe
imbd_movie_basics = pd.read_sql("""
                                SELECT * 
                                FROM movie_basics;
                                """, conn)

imbd_movie_basics

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
...,...,...,...,...,...,...
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146142,tt9916730,6 Gunn,6 Gunn,2017,116.0,None
146143,tt9916754,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,NaN,Documentary


For the `directors` table:

In [6]:
# creating a dataframe for the directors table
imbd_directors = pd.read_sql("""
                                SELECT * 
                                FROM directors;
                                """, conn)

imbd_directors

         movie_id   person_id
0       tt0285252   nm0899854
1       tt0462036   nm1940585
2       tt0835418   nm0151540
3       tt0835418   nm0151540
4       tt0878654   nm0089502
...           ...         ...
291169  tt8999974  nm10122357
291170  tt9001390   nm6711477
291171  tt9001494  nm10123242
291172  tt9001494  nm10123248
291173  tt9004986   nm4993825

[291174 rows x 2 columns]



For the `known_for` table:

In [7]:
# getting data and creating the dataframe for the known_for table
imbd_known_for = pd.read_sql("""
                                SELECT * 
                                FROM known_for;
                                """, conn)
imbd_known_for

         person_id   movie_id
0        nm0061671  tt0837562
1        nm0061671  tt2398241
2        nm0061671  tt0844471
3        nm0061671  tt0118553
4        nm0061865  tt0896534
...            ...        ...
1638255  nm9990690  tt9090932
1638256  nm9990690  tt8737130
1638257  nm9991320  tt8734436
1638258  nm9991320  tt9615610
1638259  nm9993380  tt8743182

[1638260 rows x 2 columns]

For the `movie_akas` table:

In [8]:
# creating the dataframe for the movie_akas table
imbd_movie_akas = pd.read_sql("""
                                SELECT * 
                                FROM movie_akas;
                                """, conn)
imbd_movie_akas

,movie_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,None,None,0.0
1,tt0369610,11,Jurashikku warudo,JP,None,imdbDisplay,None,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,None,imdbDisplay,None,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,None,None,short title,0.0
4,tt0369610,14,Jurassic World,FR,None,imdbDisplay,None,0.0
...,...,...,...,...,...,...,...,...
331698,tt9827784,2,Sayonara kuchibiru,None,None,original,None,1.0
331699,tt9827784,3,Farewell Song,XWW,en,imdbDisplay,None,0.0
331700,tt9880178,1,La atención,None,None,original,None,1.0
331701,tt9880178,2,La atención,ES,None,None,None,0.0
331702,tt9880178,3,The Attention,XWW,en,imdbDisplay,None,0.0

For the `movie_ratings` table:

In [9]:
# creating the dataframe for the movie_ratings table
imbd_movie_ratings = pd.read_sql("""
                                SELECT * 
                                FROM movie_ratings;
                                """, conn)
imbd_movie_ratings

         movie_id  averagerating  numvotes
0      tt10356526            8.3        31
1      tt10384606            8.9       559
2       tt1042974            6.4        20
3       tt1043726            4.2     50352
4       tt1060240            6.5        21
...           ...            ...       ...
73851   tt9805820            8.1        25
73852   tt9844256            7.5        24
73853   tt9851050            4.7        14
73854   tt9886934            7.0         5
73855   tt9894098            6.3       128

[73856 rows x 3 columns]

For the `persons` table:

In [10]:
# creating the dataframe for the persons table
imbd_persons = pd.read_sql("""
                                SELECT * 
                                FROM persons;
                                """, conn)
imbd_persons

,person_id,primary_name,birth_year,death_year,primary_profession
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator"
...,...,...,...,...,...
606643,nm9990381,Susan Grobes,NaN,NaN,actress
606644,nm9990690,Joo Yeon So,NaN,NaN,actress
606645,nm9991320,Madeline Smith,NaN,NaN,actress
606646,nm9991786,Michelle Modigliani,NaN,NaN,producer
606647,nm9993380,Pegasus Envoyé,NaN,NaN,"director,actor,writer"

For the `principals` table:

In [ ]:
# creating the dataframe for the principals table
imbd_principals = pd.read_sql("""
                                SELECT * 
                                FROM principals;
                                """, conn)
imbd_principals

For the `writers` table:

In [ ]:
# creating the dataframe for the writers table
imbd_writers = pd.read_sql("""
                                SELECT * 
                                FROM writers;
                                """, conn)
imbd_writers

## Box Office Mojo (BOM) Dataset

First we are going to read and create the BOM dataframe. Then we will clean it a little, and check the column value types for the BOM dataset (`bom_df`).

In [ ]:
# reaing the data and checking the columns data types
bom_df = pd.read_csv('zipped_data/bom.movie_gross (1).csv.gz')
print(bom_df.dtypes)

# getting rid of commas before we make the transformation
bom_df['foreign_gross'] = bom_df['foreign_gross'].str.replace(',', '')

# transforming the string object into a float
bom_df = bom_df.astype({'foreign_gross': np.float})

# checking to see if it worked
print(bom_df.dtypes)

# check to see number of NaN values in `foreign_gross`
print(
    f"Number of null values in 'foreign_gross' column :{bom_df['foreign_gross'].isnull().sum()}")

# check to see number of NaN values in `title`
print(
    f"Number of null values in 'title' column :{bom_df['title'].isnull().sum()}")

# drop rows with NaN values in `foreign_gross`
bom_df.dropna(subset=['foreign_gross'], inplace=True)

# check for NaN values in `foreign_gross`
print(
    f"Number of null values in 'foreign_gross' column after cleaning :{bom_df['foreign_gross'].isnull().sum()}")

In [ ]:
# cleaned dataset!
bom_df

## Questions about the data:

- Do certain genres result in higher grossing films?
- Is there a relationship between specific actors and higher grossing films?
- Do movies with higher average ratings result in higher grossing films?

Hopefully, after answering these questions we will have some reccomendations for Microsoft in order to direct them how to make high-grossing, successfull films!

### Do certain genres result in higher grossing films?
In order to answer this question we need to make sure our datatypes are the way we want them.

Lets start by saving `bom_df` in a SQLite database, so that we can then use SQLite to join and query the `bom_df` data set and the `imbd_movie_basics` data set.

In [ ]:
bom_df.to_sql('bom_df', conn)

Now we can query `bom_df` using SQLite.

In [ ]:
pd.read_sql("""
                SELECT * 
                FROM bom_df;
                """, conn)

Now we're going to join the two tables based on movie title and year.

In [ ]:
# we don't need the movie_id column for the first question, but we will in the second question
bom_movie_basics_joined = pd.read_sql('''
    SELECT bom_df.title, bom_df.foreign_gross, movie_basics.genres, bom_df.year, movie_basics.movie_id
    FROM bom_df
        INNER JOIN movie_basics
            /* Joining on title and year, so as to have the most accurate resulting dataset */
        ON bom_df.title=movie_basics.original_title AND bom_df.year=movie_basics.start_year
    ORDER BY foreign_gross DESC;
''', conn)
bom_movie_basics_joined

In [ ]:
bom_movie_basics_joined[bom_movie_basics_joined["title"].duplicated()]

We can use `.shape` to find the number of duplicated rows:

In [ ]:
bom_movie_basics_joined[bom_movie_basics_joined["title"].duplicated()].shape

So we have 1199 rows in our complete joined file, and 23 duplicated rows within that. Accounting for the duplication, that means that around 46 lines are doubled. 46/1299 equals to a bit less than 4%. Since it's impossible without incorperating more data to tell these duplicated movies apart (and make sure the right profits/genres are ascribed to the right movie), I'm going to delete all of them from our dataset.

In [ ]:
bom_movie_basics_joined.drop_duplicates(
    subset=['title', 'year'], keep=False, inplace=True)
bom_movie_basics_joined

Okay! Now that our data set has been cleaned a little bit, lets get back to our original question; Do certain genres result in higher grossing films? In order to look at this, we will need to seperate the listed genres.

In [ ]:
bom_movie_basics_joined['genres'] = bom_movie_basics_joined['genres'].str.split(
    pat=',')
bom_movie_basics_exploded = bom_movie_basics_joined.explode(
    'genres', ignore_index=True)

Now lets take a look at our data:

In [ ]:
print(bom_movie_basics_exploded.dtypes)
bom_movie_basics_exploded

Okay! So now we have a full workable list of the movies and their genres. 
Lets find the average amount each genre made in the dataset.

We are using the average here, as the dataset is fairly large (2995 movies) and so we are not as concerned about outliers skewing the data.

In [ ]:
bom_movie_basics_exploded_avg = bom_movie_basics_exploded.groupby(
    ['genres']).foreign_gross.mean().reset_index()
bom_movie_basics_exploded_avg

In [ ]:
# setting universal font type for this and future graphs
plt.rcParams.update({'font.family': 'serif'})

# specify size of plot
fig, ax = plt.subplots(figsize=(10, 5))

# create bar plot of top 10 grossing genres
sns.barplot(data=bom_movie_basics_exploded_avg.sort_values(by='foreign_gross', ascending=False).head(10),
            x='foreign_gross',
            y='genres',
            ci=None,
            palette='Greens_r')

# lable and define fontsize for main and axes titles
plt.xlabel('Average Gross (USD)', fontsize=14)
plt.ylabel('Movie Genres', fontsize=14)
plt.title('Average Total Gross In Movie Genres: Top 10', fontsize=17)
plt.tick_params(axis='both', which='major', labelsize=12)

# set x-axes tick labels
ax.set_xticklabels(['0', '50 Million', '100 Million',
                   '150 Million', '200 Million', '250 Million'])

# get rid of scientific notation
plt.tight_layout()
plt.show()

#### Answer: Do certain genres result in higher grossing films?

Based on the above graph, we see that there are generes that have on average higher grossing films

The top 5 genres according to the above graph are:
 - **animation**
 - **adventure** 
 - **sci-fi** 
 - **fantasy**
 - **action**
 
As such, I would advise Microsoft to focus on these 5 genres in their initial films for their new movie studio. Many of these genres can and do overlap in films, so it may be best to focus on animated movies with sub-genres of adventure, sci-fi, fantasy, or action.

### Is there a relationship between specific actors and higher grossing films?

In order to answer this question, were going to have to create a cohesive data set where we have the actors, the various films they acted in, and the total amount the movies made once they were put out.

To do this, lets create an inner join between `bom_df`, `movie_basics`, `principles` and `persons`.

In [ ]:
join_actors_gross = pd.read_sql("""
    SELECT bom.foreign_gross, bas.genres, per.person_id,  per.primary_name
    FROM bom_df AS bom
            /*joining bom_df and movie_basics*/
        INNER JOIN 
        movie_basics AS bas
        ON bom.title=bas.original_title AND bom.year=bas.start_year
            /*joining pricipals to dataset*/
        INNER JOIN 
        principals AS pri
        ON bas.movie_id=pri.movie_id
            /*joining persons to dataset*/
        INNER JOIN
        persons AS per
        ON pri.person_id=per.person_id
            WHERE category='actor' OR 'actress'
    ORDER BY foreign_gross DESC; 
    """, conn)

join_actors_gross

In [ ]:
# checking for null values - you can run this if you want, but there are no null values
# print(pd.isnull(join_actors_gross['person_id']).values.sum())
# pd.isnull(join_actors_gross['primary_name']).values.sum()

Okay! Lets try to make a data set where we have the median foreign gross per movie that the actors/actresses appeared in.

We're using the median here as there may be actors who worked in only a few movies, and we want the data to be more resistant to outliers.

The total number of actors in this dataset is 1411.

In [ ]:
median_foreign_gross_per_actor = join_actors_gross.groupby(
    ['person_id', 'primary_name'], as_index=False).median()
median_foreign_gross_per_actor

In [ ]:
# checking for duplicate rows
median_foreign_gross_per_actor[median_foreign_gross_per_actor['primary_name'].duplicated(
)]

Woohoo! There are no duplicate rows, so we can use `median_foreign_gross_per_actor` to create our next graph.

In [ ]:
# our data for this graph
top15_med_gross_actor = median_foreign_gross_per_actor.sort_values(
    by='foreign_gross', ascending=False).head(15)

# specify size of plot
fig, ax = plt.subplots(figsize=(10, 5))

# create bar plot
sns.barplot(data=top15_med_gross_actor,
            x='foreign_gross',
            y='primary_name',
            ci=None,
            palette='Greens_r')

# lable and define fontsize for main and axes titles
plt.xlabel('Median Gross (USD)', fontsize=14)
plt.ylabel('Actors', fontsize=14)
plt.title('Median Total Gross By Top 15 Actors', fontsize=17)
plt.tick_params(axis='both', which='major', labelsize=12)

# set x-axes tick labels
ax.set_xticklabels(['0', '50 Million', '100 Million',
                   '150 Million', '200 Million', '250 Million'])

plt.tight_layout()
plt.show()

#### Answer: Is there a relationship between specific actors and higher grossing films?

At a glace, we do see that there is a significant difference between the median gross of films with different actors. Suprisingly, there are only a few household names in the final 15. This may relate back to our previous finding, which is that animated films is the highest grossing movie genre. In animated films, one doesn't see the actors faces, and as such may be more 'anonymous' and unkown to the average movie watcher. On a seperate note, it is suprising that this list is comprised only of men. 
 
Before, the analysis seemed to indicate that animated films are a direction for Microsofts new movie studio to check out. Lets see if any of the top 15 actors were involved in animated films.

In [ ]:
top15_in_animation = []
for name, gross, genres in zip(join_actors_gross['primary_name'], join_actors_gross['foreign_gross'], join_actors_gross['genres']):
    if genres is not None and 'Animation' in genres:
        top15_in_animation.append([name, gross, genres, True])
    else:
        top15_in_animation.append([name, gross, genres, False])


top15_in_animation = pd.DataFrame(
    new_df, columns=['name', 'gross', 'genres', 'Is Animation in Genres'])
top15_in_animation.groupby(['name'], as_index=False).median().sort_values(
    by='gross', ascending=False).head(15)

### Do movies with higher average ratings result in higher grossing films?

Our final question! Lets look at the datset where we had the `averagerating` data again:

In [ ]:
imbd_movie_ratings

Okay! Lets do some inner joins so we can get the total gross and the average ratings.

The final dataset is 1190 average ratings, each representing

In [ ]:
join_ratings_gross = pd.read_sql("""
    SELECT bom.foreign_gross, ratings.averagerating
    FROM bom_df AS bom
            /*joining bom_df and movie_basics*/
        INNER JOIN 
        movie_basics AS bas
        ON bom.title=bas.original_title AND bom.year=bas.start_year
            /*joining movie_ratings to dataset*/
        INNER JOIN
        movie_ratings AS ratings
        ON ratings.movie_id=bas.movie_id;
        """, conn)
join_ratings_gross

In [ ]:
# save our dataframe as we want it
sorted_join_ratings_gross = join_ratings_gross.sort_values(
    by='foreign_gross', ascending=False)

# specify size of plot
fig, ax = plt.subplots(figsize=(10, 5))

# set axis ticks and labels
plt.gca().set(xlim=(5, 9))
plt.gca().set(ylim=(0, 1000000000))
ax.set_yticklabels(['0', '200 Million', '400 Million',
                   '600 Million', '800 Million', '1 Billion'])
plt.tick_params(axis='both', which='major', labelsize=12)

# add regression line
sns.regplot(sorted_join_ratings_gross.averagerating, sorted_join_ratings_gross.foreign_gross,
            scatter_kws={'color': 'g', 'alpha': 0.2}, line_kws={'color': 'dimgray', 'alpha': 0.7, 'lw': 2}, marker='d',
            robust=True)

# specifiy axis and title labels
plt.title('Total Movie Gross By Average Rating', fontsize=17)
plt.xlabel('Average Rating', fontsize=14)
plt.ylabel('Total Gross', fontsize=14)

# adding note that x axis starts at 5
plt.text(5.05, 960000000, '*Note: Average Rating displayed from 5-9')


plt.tight_layout()
plt.show()

Hmm, it doesn't seem like there is a strong correlation between these the ratings and the total gross. Lets check pearsons correlation, and see if there is a signifigant correlation.

In [ ]:
# pearsons correlation
sorted_join_ratings_gross.corr()

Anything under .25 is considered no correlation - so while there is a very, very slight positive correlation between ratings and total gross, it's not signifigant. Based on these results, one may conclude that you don't have to make amazing movies in order to end up with financially sucessfull movies.

# Conclusion
*Conclusion summarizes implications of the project for the real-world problem and stakeholders*